src/cf/InformationRegisters/пр_ОбращенияВСлужбуПоддержки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>пр_ОбращенияВСлужбуПоддержки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбращения</Name>
					<Comment>0 : пожелание, 1 : ошибка, 2 : вопрос, 3 : заявка на подключение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаОбработкуПерсДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРоли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаемаяЦель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическоеПоведение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможноПредоставлениеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прикрепления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОбращения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пр_ОбращенияВСлужбуПоддержки/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПроверитьВозможностьОтправкиОбращений(Элементы=Неопределено) Экспорт
	
	ОписаниеОшибки = "";
	НадписьКнопки  = "";
	КодОшибки      = 0;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеОшибки = НСтр("ru = 'Информационная база работает в режиме сервиса, поддержку осуществляет собственник сервиса. Обращайтесь по контактам ЛК.'");
		НадписьКнопки  = НСтр("ru = 'Контакты ЛК'");
		КодОшибки      = 1;
		
	ИначеЕсли НЕ пр_ПоддержкаОтраслевыхРешений.РегистрационныеДанныеЗаполнены() Тогда
		ОписаниеОшибки = НСтр("ru = 'Для отправки обращений из программы необходимо заполнить регистрационную информацию о продукте.'");
		НадписьКнопки  = НСтр("ru = 'Зарегистрировать продукт'");
		КодОшибки      = 2;
		
	ИначеЕсли НЕ пр_ПоддержкаОтраслевыхРешений.ВключенаОтправкаСтатистики() Тогда
		ОписаниеОшибки = НСтр("ru = 'Для отправки обращений из программы необходимо включить отправку статистики.'");
		НадписьКнопки  = НСтр("ru = 'Включить отправку статистики'");
		КодОшибки      = 3;
	КонецЕсли;
	
	Если Элементы<>Неопределено Тогда
		
		ЕстьОшибка = (КодОшибки<>0);
		Элементы.ГруппаОшибкиОтправкиОбращений.Видимость = ЕстьОшибка;
		
		Если ЕстьОшибка Тогда
			Элементы.ОписаниеОшибкиОбращений.Заголовок       = ОписаниеОшибки;
			Элементы.ОбработатьОшибкуОбращений.Заголовок     = НадписьКнопки;
			Элементы.ОбработатьОшибкуОбращений.КнопкаПоУмолчанию = ЕстьОшибка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КодОшибки;
	
КонецФункции // ПроверитьВозможностьОтправкиОбращений()

// Веб-сервер регистрации обращений пользователей отсекает окончание пакета, если оно превышает заданный лимит.
// 
// Возвращаемое значение:
//  Число - Максимальный размер файлов прикреплений в байтах.
//
Функция МаксимальныйРазмерПрикрепленийДляОбращения() Экспорт
	
	Возврат 15*1024*1024;
	
КонецФункции // МаксимальныйРазмерПрикрепленийДляОбращения()

Процедура ОтправитьОбращенияПользователейВСлужбуТехническойПоддержки(ПакетДанных) Экспорт
	
	ОтправляемыеОбращения = Новый Массив();
	ИменаПолей            = "Идентификатор,ДатаОбращения,НомерОбращения,ВидОбращения,Тема,ИдентификаторСервиса,"+
	                        "Пользователь,ЭлектроннаяПочта,Телефон,ОписаниеРоли,СогласиеНаОбработкуПерсДанных,"+
	                        "ОписаниеДействия,ОжидаемаяЦель,ФактическоеПоведение,ВозможноПредоставлениеБазы,Параметры,Прикрепления";
	ПределПакетаСервера   = МаксимальныйРазмерПрикрепленийДляОбращения();
	
	// Получим обращения с пустыми номерами регистрации
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбращенияВСлужбуПоддержки.Идентификатор КАК Идентификатор,
	|	ОбращенияВСлужбуПоддержки.ДатаОбращения КАК ДатаОбращения,
	|	ОбращенияВСлужбуПоддержки.НомерОбращения КАК НомерОбращения,
	|	ОбращенияВСлужбуПоддержки.ВидОбращения КАК ВидОбращения,
	|	ОбращенияВСлужбуПоддержки.Пользователь КАК Пользователь,
	|	ОбращенияВСлужбуПоддержки.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	ОбращенияВСлужбуПоддержки.Телефон КАК Телефон,
	|	ОбращенияВСлужбуПоддержки.Тема КАК Тема,
	|	ОбращенияВСлужбуПоддержки.ОписаниеРоли КАК ОписаниеРоли,
	|	ОбращенияВСлужбуПоддержки.ОписаниеДействия КАК ОписаниеДействия,
	|	ОбращенияВСлужбуПоддержки.ОжидаемаяЦель КАК ОжидаемаяЦель,
	|	ОбращенияВСлужбуПоддержки.ФактическоеПоведение КАК ФактическоеПоведение,
	|	ОбращенияВСлужбуПоддержки.Прикрепления КАК Прикрепления,
	|	ОбращенияВСлужбуПоддержки.ВозможноПредоставлениеБазы КАК ВозможноПредоставлениеБазы,
	|	ОбращенияВСлужбуПоддержки.ПараметрыОбращения КАК ПараметрыОбращения,
	|	ОбращенияВСлужбуПоддержки.ИдентификаторСервиса КАК ИдентификаторСервиса,
	|	ОбращенияВСлужбуПоддержки.СогласиеНаОбработкуПерсДанных КАК СогласиеНаОбработкуПерсДанных
	|ИЗ
	|	РегистрСведений.пр_ОбращенияВСлужбуПоддержки КАК ОбращенияВСлужбуПоддержки
	|ГДЕ
	|	ОбращенияВСлужбуПоддержки.НомерОбращения = """"";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ПустаяСтрока(Выборка.НомерОбращения) Тогда
			Продолжить;
		КонецЕсли;
		
		Обращение = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(Обращение, Выборка);
		
		Если Выборка.ВозможноПредоставлениеБазы Тогда
			Обращение.ОписаниеДействия = СтрШаблон("%1
			|
			|%2", Обращение.ОписаниеДействия, НСтр("ru = 'Возможно предоставление базы, на которой воспроизводится ошибка'"));
		КонецЕсли;
		
		Обращение.Пользователь = СокрЛП(Выборка.Пользователь);
		Обращение.Параметры    = Выборка.ПараметрыОбращения.Получить();
		Обращение.Прикрепления = Новый Массив();
		ОтправляемыеОбращения.Добавить(Обращение);
		
		Прикрепления = Выборка.Прикрепления.Получить();
		Если ТипЗнч(Прикрепления)<>Тип("Массив") ИЛИ Прикрепления.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		РазмерПрикреплений = 0;
		
		Для каждого ОписаниеФайла Из Прикрепления Цикл
			
			Если ТипЗнч(ОписаниеФайла)<>Тип("Структура") Или (ТипЗнч(ОписаниеФайла) = Тип("Структура") И Не ОписаниеФайла.Свойство("ИмяФайла")) Тогда
				Продолжить;
			КонецЕсли;
			
			ПрикрепленныйФайл = Новый Структура("ИмяФайла,Размер,Данные");
			ПрикрепленныйФайл.ИмяФайла = ОписаниеФайла.ИмяФайла;
			ПрикрепленныйФайл.Размер   = ОписаниеФайла.Данные.Размер();
			
			РазмерПрикреплений = РазмерПрикреплений + ПрикрепленныйФайл.Размер;
			
			Если РазмерПрикреплений > ПределПакетаСервера Тогда
				Данные = Новый ХранилищеЗначения(Неопределено);
			Иначе
				Данные = Новый ХранилищеЗначения(ОписаниеФайла.Данные, Новый СжатиеДанных(9));
			КонецЕсли;
			
			ПрикрепленныйФайл.Данные = ЗначениеВСтрокуВнутр(Данные);
			
			Обращение.Прикрепления.Добавить(ПрикрепленныйФайл);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Помещаем в пакет секцию с еще не обработанными обращениями
	Если ОтправляемыеОбращения.Количество() > 0 Тогда
		ПакетДанных.Вставить("support", ОтправляемыеОбращения);
	КонецЕсли;
	
КонецПроцедуры // ОтправитьОбращенияПользователейВСлужбуТехническойПоддержки()

Процедура ПолучитьСтатусОбработкиОбращенийПользователей(ПакетОтвета) Экспорт
	
	// Проверяем наличие серкции support в ответе
	Если пр_ПоддержкаОтраслевыхРешений.ПустоеЗначениеJSON(ПакетОтвета, "support", ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняем действия под полными правами
	Если БезопасныйРежим()=ИСТИНА Тогда
		УстановитьОтключениеБезопасногоРежима(ИСТИНА);
	КонецЕсли;
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	// Фиксируем номера обращений в базе
	Для каждого Обращение Из ПакетОтвета.support Цикл
		
		Идентификатор  = Обращение.id;
		НомерОбращения = Обращение.rn;
		
		Если ТипЗнч(Идентификатор)<>Тип("Строка") ИЛИ СтрДлина(СокрЛП(Идентификатор))<>36 Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(НомерОбращения)<>Тип("Строка") ИЛИ ПустаяСтрока(НомерОбращения) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.пр_ОбращенияВСлужбуПоддержки.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = Идентификатор;
		Запись.Прочитать();
		
		Если НЕ Запись.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Запись.НомерОбращения = НомерОбращения;
			Запись.Записать(ИСТИНА);
		Исключение
			пр_ПоддержкаОтраслевыхРешений.ОбработатьОшибку(ИнформацияОбОшибке(), "ОбращенияВСлужбуПоддержки");
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
